<?php 

$bookList = array(
	"Рэй Брэдбери" => "451° по Фаренгейту",
 	"Грегори Дэвид Робертс" => "Шантарам", 
 	"Джордж Оруэлл" => "1984", 
 	"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита", 
 	"Эрих Мария Ремарк" => "Три товарища", 
 	"Оскар Уайльд" => "Портрет Дориана Грея", 
 	"Рэй Брэдбери" => "Вино из одуванчиков", 
 	"Дэниел Киз" => "Цветы для Элджернона", 
 	"Джером Сэлинджер" => "Над пропастью во ржи", 
 	"Антуан де Сент-Экзюпери" => "Маленький принц", 
 	"Лев Толстой" => "Анна Каренина", 
 	"Габриэл Гарсиа Маркес" => "Сто лет одиночества", 
 	"Грегори Дэвид Робертс" => "Тень горы", 
 	"Айн Рэнд" => "Атлант расправил плечи"
);

echo "<ol>";
foreach ( $bookList as $author => $book) {
	echo "<li>$author => $book</li>";
}
echo "</ol>";

 ?>