<?php 

$bookList = array(
	"Рэй Брэдбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
 	"Грегори Дэвид Робертс" => ["Шантарам", "Тень горы"], 
 	"Джордж Оруэлл" => "1984", 
 	"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита", 
 	"Эрих Мария Ремарк" => "Три товарища", 
 	"Оскар Уайльд" => "Портрет Дориана Грея",  
 	"Дэниел Киз" => "Цветы для Элджернона", 
 	"Джером Сэлинджер" => "Над пропастью во ржи", 
 	"Антуан де Сент-Экзюпери" => "Маленький принц", 
 	"Лев Толстой" => "Анна Каренина", 
 	"Габриэл Гарсиа Маркес" => "Сто лет одиночества",
 	"Айн Рэнд" => "Атлант расправил плечи"
);

echo "<ol>";
foreach ( $bookList as $author => $book) {
	echo "<li><strong>{$author}:</strong> ";
	if ( is_array($book) ) {
		foreach ($book as $book) {
			echo $book . ", ";
		}
	} else {
		echo $book;
	}
	echo "</li>";
}
echo "</ol>";

 ?>